base/InformationRegisters/ПечатныеФормыОнлайнЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПечатныеФормыОнлайнЗаказов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ДокументЗаказа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОнлайнЗаказаБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/InformationRegisters/ПечатныеФормыОнлайнЗаказов/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗаписатьПечатныеФормыЗаказа(ДокументЗаказа, ПечатныеФормы) Экспорт
	
	НаборЗаписей = РегистрыСведений.ПечатныеФормыОнлайнЗаказов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументЗаказа.Установить(ДокументЗаказа);
	
	Для Каждого ПечатнаяФорма Из ПечатныеФормы Цикл
		
		Запись = НаборЗаписей.Добавить();
		Запись.ДокументЗаказа             = ДокументЗаказа;
		Запись.ИдентификаторПечатнойФормы = ПечатнаяФорма.Идентификатор;
		
	КонецЦикла;
	
	НаборЗаписей.Записать();
	
КонецФункции

Функция ИдентификаторыПечатныхФормЗаказа(ДокументЗаказа) Экспорт
	
	ИдентификаторыПечатныхФорм = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПечатныеФормыОнлайнЗаказов.ИдентификаторПечатнойФормы КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПечатныеФормыОнлайнЗаказов КАК ПечатныеФормыОнлайнЗаказов
	|ГДЕ
	|	ПечатныеФормыОнлайнЗаказов.ДокументЗаказа = &ДокументЗаказа";
	
	Запрос.УстановитьПараметр("ДокументЗаказа", ДокументЗаказа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ИдентификаторыПечатныхФорм.Добавить(Выборка.Идентификатор);
		
	КонецЦикла;
	
	Возврат ИдентификаторыПечатныхФорм;
	
КонецФункции

#КонецОбласти

#КонецЕсли
